# vstDrawCoordLine3D

```pascal
PROCEDURE vstDrawCoordLine3D(
				pt1 : REAL;
				pt2 : REAL);
```

```python
def vs.vstDrawCoordLine3D(pt1, pt2):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt1|REAL|   |
|pt2|REAL|   |

## Version
Availability: from Vectorworks 2011

## Category
* Tool Events